In [1]:
import pandas as pd
import os

In [2]:
# variable says train because this cleaning program was run on the train first, then rerun only changing the file path to read and save csv's
dfTrain = pd.read_csv("TitanicTest.csv")
dfTrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
# replace male/female with numerical values
sex = {"male": 0, "female": 1}
sexR = dfTrain.replace(sex, inplace=True)

In [4]:
sexR

In [5]:
dfTrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
dfTrain["Embarked"].unique()

array(['Q', 'S', 'C'], dtype=object)

In [7]:
# replace city identifiers with numbers.  choose these numbers to keep them between -1 and 1 incase required later by machine learning
city ={"C": -1, "S":0, "Q":1}
dfTrain.replace(city, inplace=True)
dfTrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,0
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,1
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,0

In [8]:
# all passengers without cabin were set to lowest value
dfTrain["Cabin"].fillna(0, inplace=True)
dfTrain["Cabin"].unique()

array([0, 'B45', 'E31', 'B57 B59 B63 B66', 'B36', 'A21', 'C78', 'D34',
       'D19', 'A9', 'D15', 'C31', 'C23 C25 C27', 'F G63', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C101', 'C55 C57', 'B71', 'C46', 'C116',
       'F', 'A29', 'G6', 'C6', 'C28', 'C51', 'E46', 'C54', 'C97', 'D22',
       'B10', 'F4', 'E45', 'E52', 'D30', 'B58 B60', 'E34', 'C62 C64',
       'A11', 'B11', 'C80', 'F33', 'C85', 'D37', 'C86', 'D21', 'C89',
       'F E46', 'A34', 'D', 'B26', 'C22 C26', 'B69', 'C32', 'B78',
       'F E57', 'F2', 'A18', 'C106', 'B51 B53 B55', 'D10 D12', 'E60',
       'E50', 'E39 E41', 'B52 B54 B56', 'C39', 'B24', 'D28', 'B41', 'C7',
       'D40', 'D38', 'C105'], dtype=object)

In [9]:
# make sure blanks are 0 out
dfTrain['Cabin'] = dfTrain['Cabin'].apply(lambda x: 0 if x == ' ' else x)

In [10]:
# repeated this line starting with setting cabin entries containing 'G' and 'T' to 1.  followed by 'F' to 2 all the way through cabins containing 'A' being set to 7
dfTrain.loc[dfTrain['Cabin'].str.contains('A', na=False), 'Cabin'] = 7
dfTrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,0,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,0,0
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,0,1
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,0,0

In [20]:

dfTrain["Cabin"].unique()

array([0, 6, 3, 7, 5, 4, 2, 1], dtype=int64)

In [22]:
# moved 'G' into 'F' because so few 'G' and some cabins had both letters
dfTrain["Cabin"].replace(1,2, inplace=True)
dfTrain["Cabin"].unique()

array([0, 6, 3, 7, 5, 4, 2], dtype=int64)

In [23]:
dfTrain["Age"].fillna(0, inplace=True)

In [24]:
dfTrain["Embarked"].unique()

array([ 1,  0, -1], dtype=int64)

In [40]:
dfTrain["Embarked"].fillna(-2, inplace=True)

In [28]:
dfTrain["Fare"].fillna(0, inplace=True)

In [29]:
dfTrain.to_csv("clean_test.csv", index=False)